In [1]:
import pandas as pd
import numpy as np

In [2]:
sozlukVerisi={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38]}
havaDurumuDataFrame=pd.DataFrame(sozlukVerisi)

In [3]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [4]:
havaDurumuDataFrame.dropna() #tüm nan içeren satırları siler

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [5]:
havaDurumuDataFrame.dropna(axis=1) #tüm nan içeren suyunları siler

   Izmir
0     40
1     39
2     38

In [6]:
yeniVeri={"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,39,38],"Antalya":[45,np.nan,np.nan]}
yeniDataFrame=pd.DataFrame(yeniVeri)

In [7]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [8]:
yeniDataFrame.dropna(axis=1,thresh=2) #kaç tane nan varsa onları atsın ? 2 tane

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [9]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## groupby

In [15]:
maasSozlugu={"Departman":["Yazılım","Yazılım","Pazarlama","Pazarlama","Hukuk","Hukuk"],
            "Çalışan İsmi":["Ahmet","Mehmet","Atıl","Burak","Zeynep","Fatma"],
            "Maaş":[100,150,200,300,400,500]}
maasDataFrame=pd.DataFrame(maasSozlugu)

In [16]:
maasDataFrame

   Departman Çalışan İsmi  Maaş
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atıl   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [18]:
grupObjesi=maasDataFrame.groupby("Departman")

In [22]:
grupObjesi.count() #min,max

           Çalışan İsmi  Maaş
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [23]:
grupObjesi.mean()

            Maaş
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [24]:
grupObjesi.describe() #tüm açıklaması

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0